app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."current_status" = $1  [["current_status", "pending"]]
SELECT "todos".* FROM "todos"
---
  def filter
    has_no_filter = params[:status_filter].empty?
    @todos = unless has_no_filter
      Todo.where(current_status: filter_params)
    else
      Todo.all

INSERT INTO "todos" ("title", "description", "due_date", "current_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["description", "sdfsd"], ["due_date", "2024-05-09"], ["current_status", "pending"], ["created_at", "2024-05-05 21:34:45.578820"], ["updated_at", "2024-05-05 21:34:45.578820"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "title" = $1, "due_date" = $2, "current_status" = $3, "updated_at" = $4 WHERE "todos"."id" = $5  [["title", "SofiaPro"], ["due_date", "2024-05-26"], ["current_status", "completed"], ["updated_at", "2024-05-06 04:51:27.076053"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 4]]
---
  def destroy
    @todo.destroy!